; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city9)
	(= (capacity plane1) 15420)
	(= (fuel plane1) 55)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city2)
	(= (capacity plane2) 7939)
	(= (fuel plane2) 278)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city1)
	(= (capacity plane3) 5954)
	(= (fuel plane3) 1081)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city7)
	(= (capacity plane4) 10783)
	(= (fuel plane4) 2295)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city5)
	(= (capacity plane5) 4572)
	(= (fuel plane5) 276)
	(= (slow-burn plane5) 2)
	(= (fast-burn plane5) 5)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 8)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city7)
	(at person5 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 752)
	(= (distance city0 city2) 665)
	(= (distance city0 city3) 516)
	(= (distance city0 city4) 936)
	(= (distance city0 city5) 567)
	(= (distance city0 city6) 782)
	(= (distance city0 city7) 926)
	(= (distance city0 city8) 752)
	(= (distance city0 city9) 702)
	(= (distance city1 city0) 752)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 658)
	(= (distance city1 city3) 617)
	(= (distance city1 city4) 578)
	(= (distance city1 city5) 620)
	(= (distance city1 city6) 699)
	(= (distance city1 city7) 916)
	(= (distance city1 city8) 525)
	(= (distance city1 city9) 895)
	(= (distance city2 city0) 665)
	(= (distance city2 city1) 658)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 930)
	(= (distance city2 city4) 924)
	(= (distance city2 city5) 568)
	(= (distance city2 city6) 818)
	(= (distance city2 city7) 610)
	(= (distance city2 city8) 559)
	(= (distance city2 city9) 829)
	(= (distance city3 city0) 516)
	(= (distance city3 city1) 617)
	(= (distance city3 city2) 930)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 856)
	(= (distance city3 city5) 580)
	(= (distance city3 city6) 761)
	(= (distance city3 city7) 816)
	(= (distance city3 city8) 660)
	(= (distance city3 city9) 726)
	(= (distance city4 city0) 936)
	(= (distance city4 city1) 578)
	(= (distance city4 city2) 924)
	(= (distance city4 city3) 856)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 984)
	(= (distance city4 city6) 913)
	(= (distance city4 city7) 891)
	(= (distance city4 city8) 501)
	(= (distance city4 city9) 850)
	(= (distance city5 city0) 567)
	(= (distance city5 city1) 620)
	(= (distance city5 city2) 568)
	(= (distance city5 city3) 580)
	(= (distance city5 city4) 984)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 959)
	(= (distance city5 city7) 783)
	(= (distance city5 city8) 776)
	(= (distance city5 city9) 711)
	(= (distance city6 city0) 782)
	(= (distance city6 city1) 699)
	(= (distance city6 city2) 818)
	(= (distance city6 city3) 761)
	(= (distance city6 city4) 913)
	(= (distance city6 city5) 959)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 985)
	(= (distance city6 city8) 935)
	(= (distance city6 city9) 829)
	(= (distance city7 city0) 926)
	(= (distance city7 city1) 916)
	(= (distance city7 city2) 610)
	(= (distance city7 city3) 816)
	(= (distance city7 city4) 891)
	(= (distance city7 city5) 783)
	(= (distance city7 city6) 985)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 564)
	(= (distance city7 city9) 555)
	(= (distance city8 city0) 752)
	(= (distance city8 city1) 525)
	(= (distance city8 city2) 559)
	(= (distance city8 city3) 660)
	(= (distance city8 city4) 501)
	(= (distance city8 city5) 776)
	(= (distance city8 city6) 935)
	(= (distance city8 city7) 564)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 528)
	(= (distance city9 city0) 702)
	(= (distance city9 city1) 895)
	(= (distance city9 city2) 829)
	(= (distance city9 city3) 726)
	(= (distance city9 city4) 850)
	(= (distance city9 city5) 711)
	(= (distance city9 city6) 829)
	(= (distance city9 city7) 555)
	(= (distance city9 city8) 528)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane2 city6)
	(at plane3 city6)
	(at plane5 city7)
	(at person1 city8)
	(at person2 city0)
	(at person3 city2)
	(at person4 city2)
	(at person5 city7)
	))

(:metric minimize (+ (* 2 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane5 city5)
   changed: (fuel plane5) from 276 to 4572
   goals met: 1 of 9
2. (refuel plane1 city9)
   changed: (fuel plane1) from 55 to 15420
   goals met: 1 of 9
3. (fly plane1 city9 city1)
   deleted: (at plane1 city9)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 4475, (fuel plane1) from 15420 to 10945
   goals met: 2 of 9
4. (refuel plane2 city2)
   changed: (fuel plane2) from 278 to 7939
   goals met: 2 of 9
5. (board person5 plane5 city5)
   deleted: (at person5 city5)
   added: (in person5 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 9
6. (fly plane5 city5 city7)
   deleted: (at plane5 city5)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 4475 to 6041, (fuel plane5) from 4572 to 3006
   goals met: 3 of 9
7. (debark person5 plane5 city7)
   deleted: (in person5 plane5)
   added: (at person5 city7)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 9
8. (refuel plane3 city1)
   changed: (fuel plane3) from 1081 to 5954
   goals met: 4 of 9
9. (zoom plane3 city1 city6)
   deleted: (at plane3 city1)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 6041 to 10235, (fuel plane3) from 5954 to 1760
   goals met: 5 of 9
10. (board person4 plane5 city7)
   deleted: (at person4 city7)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 5 of 9
11. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 9
12. (fly plane2 city2 city8)
   deleted: (at plane2 city2)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 10235 to 11912, (fuel plane2) from 7939 to 6262
   goals met: 5 of 9
13. (debark person1 plane2 city8)
   deleted: (in person1 plane2)
   added: (at person1 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 9
14. (fly plane2 city8 city6)
   deleted: (at plane2 city8)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 11912 to 14717, (fuel plane2) from 6262 to 3457
   goals met: 7 of 9
15. (fly plane5 city7 city2)
   deleted: (at plane5 city7)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 14717 to 15937, (fuel plane5) from 3006 to 1786
   goals met: 6 of 9
16. (debark person4 plane5 city2)
   deleted: (in person4 plane5)
   added: (at person4 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 7 of 9
17. (fly plane5 city2 city7)
   deleted: (at plane5 city2)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 15937 to 17157, (fuel plane5) from 1786 to 566
   goals met: 8 of 9
18. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 17157 to 20917, (fuel plane1) from 10945 to 7185
   goals met: 7 of 9
19. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 9
20. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 20917 to 24242, (fuel plane1) from 7185 to 3860
   goals met: 7 of 9
21. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
22. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 24242 to 27532, (fuel plane1) from 3860 to 570
   goals met: 9 of 9
